class MapsConfig:
    """Содержит объекты карты для копирования и их числовые значения"""
    def __init__(self):
        self._keys = {1: 'road', 2: 'road', 3:'base', 4:'basic', 5:'increase_damage', 6:'increase_radius', 7:'armor_piercing', 8:'poison', 9:'additional_money'}
        self._maps_array = [[[0, 3, 4, 4, 4],
                            [4, 1, 1, 1, 0],
                            [5, 0, 6, 1, 6],
                            [0, 1, 1, 1, 4],
                            [4, 2, 4, 0, 4]],
                            [[3, 1, 1, 1, 4],
                             [4, 5, 4, 1, 4],
                             [1, 1, 1, 1, 0],  # 1-4, 2-5, 3-6, 4-7, 5-8, 6-9
                             [1, 4, 0, 7, 0],
                             [2, 4, 6, 0, 0]],
                            [[0, 0, 0, 0, 0, 8, 0],
                             [0, 0, 4, 7, 1, 1, 3],
                             [0, 8, 5, 0, 1, 4, 0],
                             [2, 1, 4, 1, 1, 6, 0],
                             [4, 1, 1, 1, 4, 0, 0]],
                            [[0, 4, 2, 0, 0, 0, 0],
                             [4, 1, 1, 4, 4, 6, 0],
                             [4, 1, 4, 1, 1, 0, 0],
                             [0, 1, 0, 3, 1, 0, 4],
                             [8, 1, 7, 0, 1, 4, 0],
                             [0, 1, 1, 1, 1, 4, 0],
                             [4, 0, 0, 5, 0, 0, 0]],
                            [[0, 0, 0, 0, 4, 0, 0],
                             [4, 4, 0, 1, 1, 1, 0],
                             [0, 1, 1, 1, 0, 1, 8],
                             [4, 1, 4, 9, 0, 1, 4],
                             [5, 1, 0, 0, 0, 1, 4],
                             [0, 3, 0, 6, 7, 1, 2],
                             [0, 0, 0, 0, 0, 4, 0]],
                            [[0, 0, 4, 0, 0, 4, 4],
                             [4, 1, 1, 1, 1, 1, 4],
                             [0, 3, 4, 0, 0, 1, 0],
                             [0, 0, 6, 0, 7, 1, 4],
                             [0, 4, 0, 8, 0, 1, 5],
                             [4, 0, 1, 1, 1, 1, 4],
                             [0, 4, 2, 0, 9, 0, 0]]
                            ]

    @property
    def keys(self):
        return self._keys

    @property
    def maps_array(self):
        return self._maps_array

if __name__ == '__main__':
    keys = {1: 'road', 2: 'base', 3 | 9: 'basic', 4: 'increase_damage', 5: 'increase_radius', 6: 'armor_piercing', 7: 'poison', 8: 'additional_money'}
    print(keys[3 | 9])
    print(keys[9])